test/load/#01_04-04-2024.txt
$ autocannon -c 500 -d 20 -w 4 -W [ -c 1 -d 3 ] http://localhost:3000/cars
Running 3s warmup @ http://localhost:3000/cars
1 connections
4 workers

Running 20s test @ http://localhost:3000/cars
500 connections
4 workers

-
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 212 ms │ 220 ms │ 1769 ms │ 2045 ms │ 309.95 ms │ 460.35 ms │ 4906 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬─────────┬────────┐   
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min    │   
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 1.644  │ 1.644  │ 2.251   │ 2.327   │ 2.209,9 │ 152,15  │ 1.644  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 743 kB │ 743 kB │ 1.02 MB │ 1.05 MB │ 999 kB  │ 68.6 kB │ 743 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 80

45k requests in 20.06s, 20 MB read
203 errors (0 timeouts)