test/load/#01_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬────────┬────────┬─────────┬─────────┬────────────┬────────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼────────────┼────────────┼─────────┤
│ Latency │ 212 ms │ 238 ms │ 6570 ms │ 6667 ms │ 1097.65 ms │ 1667.03 ms │ 7248 ms │
└─────────┴────────┴────────┴─────────┴─────────┴────────────┴────────────┴─────────┘
┌───────────┬────────┬────────┬────────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 1.424  │ 1.424  │ 2.137  │ 2.327   │ 2.123,6 │ 184,52  │ 1.424  │
├───────────┼────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 644 kB │ 644 kB │ 966 kB │ 1.05 MB │ 960 kB  │ 83.3 kB │ 644 kB │
└───────────┴────────┴────────┴────────┴─────────┴─────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 42463 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 69           │
├────────────┼──────────────┤
│ 0.01       │ 77           │
├────────────┼──────────────┤
│ 0.1        │ 93           │
├────────────┼──────────────┤
│ 1          │ 187          │
├────────────┼──────────────┤
│ 2.5        │ 212          │
├────────────┼──────────────┤
│ 10         │ 216          │
├────────────┼──────────────┤
│ 25         │ 222          │
├────────────┼──────────────┤
│ 50         │ 238          │
├────────────┼──────────────┤
│ 75         │ 757          │
├────────────┼──────────────┤
│ 90         │ 4203         │
├────────────┼──────────────┤
│ 97.5       │ 6570         │
├────────────┼──────────────┤
│ 99         │ 6667         │
├────────────┼──────────────┤
│ 99.9       │ 6908         │
├────────────┼──────────────┤
│ 99.99      │ 7242         │
├────────────┼──────────────┤
│ 99.999     │ 7248         │
└────────────┴──────────────┘

45k requests in 20.15s, 19.2 MB read
2k errors (0 timeouts)