test/load/#01_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 134 ms │ 447 ms │ 13361 ms │ 14912 ms │ 2196.08 ms │ 3570.54 ms │ 18285 ms │
└─────────┴────────┴────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬────────┬────────┐        
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min    │        
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤        
│ Req/Sec   │ 792    │ 792    │ 2.453   │ 3.241   │ 2.333,85 │ 775,34 │ 792    │        
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 532 kB │ 532 kB │ 1.65 MB │ 2.18 MB │ 1.57 MB  │ 521 kB │ 532 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 46671 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 19           │
├────────────┼──────────────┤
│ 0.01       │ 22           │
├────────────┼──────────────┤
│ 0.1        │ 53           │
├────────────┼──────────────┤
│ 1          │ 126          │
├────────────┼──────────────┤
│ 2.5        │ 134          │
├────────────┼──────────────┤
│ 10         │ 152          │
├────────────┼──────────────┤
│ 25         │ 181          │
├────────────┼──────────────┤
│ 50         │ 447          │
├────────────┼──────────────┤
│ 75         │ 2676         │
├────────────┼──────────────┤
│ 90         │ 7284         │
├────────────┼──────────────┤
│ 97.5       │ 13361        │
├────────────┼──────────────┤
│ 99         │ 14912        │
├────────────┼──────────────┤
│ 99.9       │ 17421        │
├────────────┼──────────────┤
│ 99.99      │ 18250        │
├────────────┼──────────────┤
│ 99.999     │ 18285        │
└────────────┴──────────────┘

55k requests in 20.07s, 31.4 MB read
8k errors (0 timeouts)