test/load/#02_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼────────────┼──────────┤
│ Latency │ 125 ms │ 192 ms │ 8064 ms │ 8490 ms │ 1241.9 ms │ 2019.55 ms │ 10148 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Req/Sec   │ 1.362  │ 1.362  │ 2.963   │ 3.467   │ 2.846,05 │ 483,3  │ 1.362  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 915 kB │ 915 kB │ 1.99 MB │ 2.33 MB │ 1.91 MB  │ 325 kB │ 915 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 56912 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 25           │
├────────────┼──────────────┤
│ 0.01       │ 31           │
├────────────┼──────────────┤
│ 0.1        │ 68           │
├────────────┼──────────────┤
│ 1          │ 113          │
├────────────┼──────────────┤
│ 2.5        │ 125          │
├────────────┼──────────────┤
│ 10         │ 139          │
├────────────┼──────────────┤
│ 25         │ 156          │
├────────────┼──────────────┤
│ 50         │ 192          │
├────────────┼──────────────┤
│ 75         │ 1290         │
├────────────┼──────────────┤
│ 90         │ 3956         │
├────────────┼──────────────┤
│ 97.5       │ 8064         │
├────────────┼──────────────┤
│ 99         │ 8490         │
├────────────┼──────────────┤
│ 99.9       │ 9657         │
├────────────┼──────────────┤
│ 99.99      │ 9982         │
├────────────┼──────────────┤
│ 99.999     │ 10148        │
└────────────┴──────────────┘

61k requests in 20.08s, 38.2 MB read
4k errors (0 timeouts)