test/load/#02_04-04-2024.txt
$ autocannon -c 500 -d 20 -w 4 -W [ -c 1 -d 3 ] http://localhost:3000/cars
Running 3s warmup @ http://localhost:3000/cars
1 connections
4 workers

Running 20s test @ http://localhost:3000/cars
500 connections
4 workers

-
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 211 ms │ 218 ms │ 2392 ms │ 2435 ms │ 318.58 ms │ 443.02 ms │ 2823 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Req/Sec   │ 1.880  │ 1.880  │ 2.259   │ 2.367   │ 2.244,4 │ 119,83  │ 1.880  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼─────────┼────────┤
│ Bytes/Sec │ 850 kB │ 850 kB │ 1.02 MB │ 1.07 MB │ 1.01 MB │ 54.1 kB │ 850 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴─────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 80

46k requests in 20.06s, 20.3 MB read
232 errors (0 timeouts)