test/load/#03_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

-
┌─────────┬────────┬────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 120 ms │ 200 ms │ 7289 ms │ 11157 ms │ 1311.65 ms │ 2346.29 ms │ 18823 ms │
└─────────┴────────┴────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Req/Sec   │ 1.368  │ 1.368  │ 3.023   │ 3.643   │ 2.941,95 │ 445,91 │ 1.368  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 920 kB │ 920 kB │ 2.03 MB │ 2.45 MB │ 1.98 MB  │ 300 kB │ 919 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 58829 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 9            │
├────────────┼──────────────┤
│ 0.1        │ 56           │
├────────────┼──────────────┤
│ 1          │ 100          │
├────────────┼──────────────┤
│ 2.5        │ 120          │
├────────────┼──────────────┤
│ 10         │ 138          │
├────────────┼──────────────┤
│ 25         │ 154          │
├────────────┼──────────────┤
│ 50         │ 200          │
├────────────┼──────────────┤
│ 75         │ 1494         │
├────────────┼──────────────┤
│ 90         │ 3382         │
├────────────┼──────────────┤
│ 97.5       │ 7289         │
├────────────┼──────────────┤
│ 99         │ 11157        │
├────────────┼──────────────┤
│ 99.9       │ 18023        │
├────────────┼──────────────┤
│ 99.99      │ 18706        │
├────────────┼──────────────┤
│ 99.999     │ 18823        │
└────────────┴──────────────┘

64k requests in 20.09s, 39.5 MB read
5k errors (0 timeouts)