test/load/#04_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 120 ms │ 185 ms │ 5911 ms │ 12878 ms │ 1194.33 ms │ 2233.52 ms │ 18243 ms │
└─────────┴────────┴────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 1.439  │ 1.439  │ 3.149   │ 3.587   │ 3.076,7 │ 459,77 │ 1.439  │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 967 kB │ 967 kB │ 2.12 MB │ 2.41 MB │ 2.07 MB │ 309 kB │ 967 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 61523 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 36           │
├────────────┼──────────────┤
│ 0.01       │ 40           │
├────────────┼──────────────┤
│ 0.1        │ 60           │
├────────────┼──────────────┤
│ 1          │ 107          │
├────────────┼──────────────┤
│ 2.5        │ 120          │
├────────────┼──────────────┤
│ 10         │ 134          │
├────────────┼──────────────┤
│ 25         │ 148          │
├────────────┼──────────────┤
│ 50         │ 185          │
├────────────┼──────────────┤
│ 75         │ 1313         │
├────────────┼──────────────┤
│ 90         │ 3080         │
├────────────┼──────────────┤
│ 97.5       │ 5911         │
├────────────┼──────────────┤
│ 99         │ 12878        │
├────────────┼──────────────┤
│ 99.9       │ 17157        │
├────────────┼──────────────┤
│ 99.99      │ 17842        │
├────────────┼──────────────┤
│ 99.999     │ 18243        │
└────────────┴──────────────┘

66k requests in 20.07s, 41.3 MB read
4k errors (0 timeouts)